(load "my_lib.scm")

(սահմանել (գծային փոփոխական1 փոփոխական2)
	( եթե (= փոփոխական1 0) և (= փոփոխական2 0)
		"ունի անվերջ քանակի լուծում"
	այլապես (begin 
	(եթե փոփոխական1 = 0 
		"լուծում չունի"
	այլապես 
		(/ (- փոփոխական2) փոփոխական1)))))


(սահմանել (ստուգում փոփոխական1 փոփոխական2 արդյունք)
  	(begin
	(սահմանել արժեք (գծային փոփոխական1 փոփոխական2))
	(եթե արժեք  = արդյունք  
	      (արտածել "ճիշտ" )
	այլապես 
		(արտածել "սխալ"))))



(ստուգում 12 24 -2)
(ստուգում 1 -4 4)
(ստուգում 13 -39 3)
(ստուգում 5 4 -4/5)

